darcyg/nrf24l01_wsn/pic24f_RTOS_adv.X/framework/uip/nrf24l01_link.c
/*
 * pic24f RTOS based OS
 * Copyright (C) 2015 <spiriou31@gmail.com>
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by the Free
 * Software Foundation, either version 3 of the License, or (at your option)
 * any later version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of  MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 * You should have received a copy of the GNU General Public License along with
 * this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#include "uip/nrf24l01_link.h"
// os modules
#include "FreeRTOS.h"
#include "device.h"
#include "task.h"
#include "timers.h"
// Utils
#include <stdbool.h>
#include "logger.h"
#include "uip/uip.h"
// I/O modules
#include "nrf24l01.h"
#include "pic24f_gpio.h" // TODO: remove

typedef enum {
    IDLE_NO_TX = 1,
    IDLE,
    RX,
    TX_RTS,
    TX,
} NRF_STATE;

struct nrf24l01_link_info {
    uip_ipaddr_t ip;                          /*!< IP address */
    uip_ipaddr_t gateway;                     /*!< Gateway IP address */
    uip_ipaddr_t mask;                        /*!< Network mask */
    volatile NRF_STATE state;                 /*!< Current state of transmission */
    TimerHandle_t timer;                      /*!< Timer for timeout detection */
    volatile NRF_STATE timeout_state;
    TaskHandle_t task;

    QueueHandle_t rx_queue;                        /*!< RX buffer queue */
    QueueHandle_t tx_queue;                        /*!< TX buffer queue */
    struct nrf_buffer pool[NRF_LINK_BUFFER_COUNT]; /*!< RX/TX buffer pool */
    struct nrf_buffer *rx_buffer;                  /*!< Current buffer for RX */
    struct nrf_buffer *tx_buffer;                  /*!< Current buffer for TX */
    struct nrf_buffer *pool_head;                  /*!< head of pool */
    // RX status
    uint8_t rx_pkg_count;
    uint8_t rx_pkg_index;
    // TX status
    uint8_t tx_pkg_index;
    unsigned int retransmit_pkg;
    unsigned int retransmit;
    // Link status
    unsigned int rx_packets;
    unsigned int tx_packets;
    unsigned int rx_dropped;
    unsigned int tx_dropped;
};

// Avoid allocating this structure in FreeRTOS task stack
static struct nrf24l01_link_info nrf_link;

// link management functions
static void nrf_link_task(void *arg);
static void nrf_ip2mac(uip_ipaddr_t ip_addr, uint8_t* mac_addr);
static void nrf_link_timeout_callback(void *priv);
static void nrf_irq_callback(void *priv);

// link processing functions
static inline void nrf_process_idle(struct device *dev, uint8_t nrf_status, uint8_t size);
static inline void nrf_process_rx(struct device *dev, uint8_t nrf_status, uint8_t size);
static inline void nrf_link_handle_rx(struct device *dev, uint8_t status);

static inline void nrf_process_tx_rts(struct device *dev, uint8_t nrf_status);
static inline void nrf_process_tx(struct device *dev, uint8_t nrf_status);
static inline void nrf_link_handle_tx(struct device *dev, uint8_t status);

uint8_t timer_id = 0xde;

void nrf_link_init(const int dev_id, uip_ipaddr_t ip, uip_ipaddr_t gateway, uip_ipaddr_t mask, UBaseType_t priority)
{
    struct device* dev = get_device(dev_id);
    if (dev == NULL) {
        log_error("nrf dev <%d> not found", dev_id);
        return;
    }
    // Copy network configuration
    memcpy(nrf_link.ip,      ip,      sizeof(uip_ipaddr_t));
    memcpy(nrf_link.gateway, gateway, sizeof(uip_ipaddr_t));
    memcpy(nrf_link.mask,    mask,    sizeof(uip_ipaddr_t));

    // Create nrf_link task
    xTaskCreate(nrf_link_task, "uip", configMINIMAL_STACK_SIZE, dev, priority, &nrf_link.task);
    // Create timeout timer
    nrf_link.timer = xTimerCreate("nrf", (TickType_t)pdMS_TO_TICKS(NRF_TIMEOUT), pdFALSE,
                                  &timer_id, nrf_link_timeout_callback);
    // Create rx buffer queue
    nrf_link.rx_queue = xQueueCreate(NRF_LINK_BUFFER_COUNT, sizeof(struct nrf_buffer*));
    if (!nrf_link.rx_queue) {
        log_error("fail alloc RX queue");
    }
    nrf_link.tx_queue = xQueueCreate(NRF_LINK_BUFFER_COUNT, sizeof(struct nrf_buffer*));
    if (!nrf_link.tx_queue) {
        log_error("fail alloc TX queue");
    }
}

void nrf_link_timeout_callback(void *priv)
{
    nrf_link.timeout_state = nrf_link.state;
    xTaskNotifyGive(nrf_link.task);
}

void nrf_irq_callback(void *priv)
{
    portBASE_TYPE xHigherPriorityTaskWoken;
    vTaskNotifyGiveFromISR(nrf_link.task, &xHigherPriorityTaskWoken);

    if (xHigherPriorityTaskWoken != pdFALSE) {
        taskYIELD();
    }
}

BaseType_t nrf_link_wait_rx(struct nrf_buffer **buffer, TickType_t timeout)
{
    return xQueueReceive(nrf_link.rx_queue, buffer, timeout);
}

struct nrf_buffer* nrf_link_get_buffer(void)
{
    // Function protected against concurrent access
    taskENTER_CRITICAL();
    if (!nrf_link.pool_head) {
        // buffer not available
        taskEXIT_CRITICAL();
        return NULL;
    }
    // Buffer available
    struct nrf_buffer *ret = nrf_link.pool_head;
    nrf_link.pool_head = nrf_link.pool_head->next;
    taskEXIT_CRITICAL();
    return ret;
}

void nrf_link_free_buffer(struct nrf_buffer *buf)
{
    buf->next = 0;

    // Function protected against concurrent access
    taskENTER_CRITICAL();
    if (!nrf_link.pool_head) {
        nrf_link.pool_head = buf;
        taskEXIT_CRITICAL();
        return;
    }
    // Buffer available
    struct nrf_buffer *cur = nrf_link.pool_head;
    for (; cur->next; cur = cur->next);
    cur->next = buf;
    taskEXIT_CRITICAL();
}

void nrf_link_send_buffer(struct nrf_buffer *buf)
{
    // Configure control byte
    buf->buf.ctl_byte = ((buf->len + 30) / 31) | 0x80;
    // Send buffer
    xQueueSend(nrf_link.tx_queue, &buf, 0);
    xTaskNotifyGive(nrf_link.task);
}

static void nrf_link_task_init(struct device *dev)
{
    // Disable device
    nrf24l01_clear_ce(dev);

    {
        // Compute RX, and TX addrs
        uint8_t addr_p1[5];
        uint8_t addr_tx[5];
        nrf_ip2mac(nrf_link.ip, addr_p1);
        nrf_ip2mac(nrf_link.gateway, addr_tx);
        // Set nrf24l01 configuration
        nrf24l01_set_configuration(dev, nrf_irq_callback, NULL,
                nrf24l01_CONFIG_DEFAULT_VAL | nrf24l01_CONFIG_PWR_UP | nrf24l01_CONFIG_PRIM_RX,
                nrf24l01_EN_AA_ENAA_P0 | nrf24l01_EN_AA_ENAA_P1,
                nrf24l01_EN_RXADDR_ERX_P0 | nrf24l01_EN_RXADDR_ERX_P1 | nrf24l01_EN_RXADDR_ERX_P2,
                nrf24l01_SETUP_AW_DEFAULT_VAL,
                nrf24l01_SETUP_RETR_ARD_250 | nrf24l01_SETUP_RETR_ARC_2,
                nrf24l01_RF_CH_DEFAULT_VAL,
                nrf24l01_RF_SETUP_DEFAULT_VAL,
                NULL,   // RX_ADDR_P0
                addr_p1,   // mac_addr,
                0xff,   // rts pipe address
                nrf24l01_RX_ADDR_P3_DEFAULT_VAL,
                nrf24l01_RX_ADDR_P4_DEFAULT_VAL,
                nrf24l01_RX_ADDR_P5_DEFAULT_VAL,
                addr_tx,   // TX_ADDR
                1,      // enable pipe 0
                1,      // enable pipe 1
                1,      // enable pipe 2
                nrf24l01_RX_PW_P3_DEFAULT_VAL,
                nrf24l01_RX_PW_P4_DEFAULT_VAL,
                nrf24l01_RX_PW_P5_DEFAULT_VAL,
                nrf24l01_DYNPD_DPL_P0 | nrf24l01_DYNPD_DPL_P1 | nrf24l01_DYNPD_DPL_P2, // Dyn payload size
                nrf24l01_FEATURE_EN_DPL | nrf24l01_FEATURE_EN_DYN_ACK);
    }
    // Wait for powerup
    vTaskDelay((TickType_t) pdMS_TO_TICKS(10));
    nrf_link.state = IDLE;
    nrf_link.timeout_state = 0;
    // nrf_timer = 0;
    // nrf_notx_timer = 0;
    // nrf_tx_len = 0; // Noting to TX
    
    // Init buffer pool
    {
        unsigned int i;
        for (i=0; i<NRF_LINK_BUFFER_COUNT-1; i++) {
            nrf_link.pool[i].len = 0;
            nrf_link.pool[i].next = &nrf_link.pool[i+1];
        }
        nrf_link.pool[i].len = 0;
        nrf_link.pool[i].next = 0;
        nrf_link.pool_head = nrf_link.pool;
    }
    // Init rx and tx buffers
    nrf_link.rx_buffer = nrf_link_get_buffer();
    nrf_link.tx_buffer = NULL;

