darcyg/nrf24l01_wsn/pic24f_RTOS_adv.X/framework/uip/nrf24l01_link.c
    // Activate FEATURE REGISTER
    nrf24l01_activate_feature(dev);
    // Clear FIFO queues
    nrf24l01_flush_rx(dev);
    nrf24l01_flush_tx(dev);
    // Clear all irqs
    nrf24l01_irq_clear_all(dev);
    // Device is ready to operate, enable it
    nrf24l01_set_ce(dev);

    nrf_link.rx_packets = 0;
    nrf_link.tx_packets = 0;
    nrf_link.rx_dropped = 0;
    nrf_link.tx_dropped = 0;
}

static void nrf_link_task(void *arg)
{
    struct device *dev = (struct device*)arg;

    nrf_link_task_init(dev);

    while (1) {
        ulTaskNotifyTake(pdTRUE, (TickType_t)portMAX_DELAY);
        // We reach this line because of IRQ, TX queue or timeout

        // We receive buf in the same time we tx (2 buffers)
        while(1) {
            // Clear all irqs and reload status register
            nrf24l01_irq_clear_all(dev);
            // Save the source of interrupt (RX, TX or RT)
            uint8_t status = nrf24l01_get_status(dev);

            // Handle RX frame
            nrf_link_handle_rx(dev, status);
            // Handle TX frame
            nrf_link_handle_tx(dev, status);

            if (!gpio_get(GPIO_PORTA | 0)) {
                // Interrupt still pending, process it
                continue;
            }

            if (nrf_link.timeout_state != 0) {
                if (nrf_link.timeout_state != nrf_link.state) {
                    log_info("fake timeout %d %d", nrf_link.state, nrf_link.timeout_state);
                    nrf_link.timeout_state = 0;
                } else {
                    nrf_link.timeout_state = 0;
                    // log_info("valid timeout %d", nrf_link.state);
                    // Timeout detected
                    if (nrf_link.state <= RX) {
                        if (nrf_link.state == RX) {
                            nrf_link.rx_dropped++;
                        }
                        // RX/TX_NO_IDLE timeout, go IDLE
                        nrf_link.state = IDLE;
                        // Ready for TX ?
                        nrf_link_handle_tx(dev, 0);
                    } else {
                        // Check unknown state (nrf not configured)
                        uint8_t config = nrf24l01_get_config(dev);
                        log_info("tm for %d (%x)", nrf_link.state, config);
                        nrf24l01_clear_ce(dev);
                        nrf24l01_set_as_rx(dev);
                        nrf24l01_set_ce(dev);
                        // TX/TX_RTS timeout, goto IDLE_NO_TX and start timer
                        nrf_link.state = IDLE_NO_TX;
                        xTimerStart(nrf_link.timer, (TickType_t)portMAX_DELAY);
                        // Set nrf24l01 to RX state
                        nrf24l01_flush_rx(dev);
                        nrf24l01_flush_tx(dev);
                        nrf24l01_irq_clear_all(dev);
                        nrf_link.tx_dropped++;
                    }
                }
            }
            break;
        }
    }
}

static inline void nrf_link_handle_tx(struct device *dev, uint8_t status)
{
    switch (nrf_link.state) {
        case IDLE:
            if (!nrf_link.tx_buffer) {
                if (xQueueReceive(nrf_link.tx_queue, &nrf_link.tx_buffer, 0)) {
                    // New buffer to TX
                    // Init tx rt to default value (3-5) before skb is dropped (for RTS/TX)
                    nrf_link.retransmit = NRF_RETRANSMIT;
                } else {
                    // Nothing to TX
                    break;
                }
            }

            if (!(--nrf_link.retransmit)) {
                // skb TX failed, drop skb
                log_error("TX RT");
                nrf_link_free_buffer(nrf_link.tx_buffer);
                nrf_link.tx_buffer = NULL;
                nrf_link.tx_dropped++;
                break;
            }
            // Start TX transfer
            // log_info("start TX tr %d", nrf_link.tx_buffer->len);
            // nrf_link_free_buffer(nrf_link.tx_buffer);
            // nrf_link.tx_buffer = NULL;
            uint8_t nrf_rts_frame[11];
            uint8_t addr[5];

            nrf24l01_clear_ce(dev);
            nrf24l01_set_as_tx(dev);
            nrf24l01_flush_tx(dev); // TODO : remove
            nrf24l01_irq_clear_all(dev);

            // Set TX broadcast addr
            nrf_ip2mac(nrf_link.gateway, addr);
            addr[0] = 0xff;
            nrf24l01_set_tx_addr(dev, addr, 0);


            nrf_rts_frame[0] = 0x8a;
            // src nrf addr
            memcpy(&nrf_rts_frame[1], nrf24l01_get_rx_addr(dev), 5);
            // dst nrf addr
            memcpy(&nrf_rts_frame[6], nrf24l01_get_rx_addr(dev), 5);
            nrf_rts_frame[6] = 0xc2;

            nrf24l01_write_tx_payload_no_ack(dev, nrf_rts_frame, 11);
            nrf24l01_transmit(dev);

            nrf_link.state = TX_RTS;
            // Start timer for TX time slot (RTS+skb)
            xTimerStart(nrf_link.timer, (TickType_t)portMAX_DELAY);
            break;

        case TX_RTS:
            nrf_process_tx_rts(dev, status);
            break;
        case TX:
            nrf_process_tx(dev, status);
            break;
        default:
            break;
    }
}

static inline void nrf_link_handle_rx(struct device *dev, uint8_t nrf_status)
{
    uint8_t size;

    if ((nrf_status & nrf24l01_STATUS_RX_P_NO) == 0x0e) {
        // No pkg received
        return;
    }
    // read packet size
    nrf24l01_r_rx_pl_wid(dev, &size);
    // Update local status (to save pipe number of current packet)
    nrf_status = nrf24l01_get_status(dev);

    // check if a valid packet has been received in rx pipe
    while ((nrf_status & nrf24l01_STATUS_RX_P_NO) != 0x0e) {
        if ((!size) || (size > 32)) {
            log_error("IDLE RX error (%02x %d)", nrf_status, size);
            goto get_next_pkg;
        }
        else if (!nrf_link.rx_buffer && !(nrf_link.rx_buffer = nrf_link_get_buffer())) {
            // Try to get another one
            // rx buffer not available, drop rx frame
            log_info("no rx buf %02x %d %d %d", nrf_status, size,
                     uxQueueMessagesWaiting(nrf_link.tx_queue),
                     uxQueueMessagesWaiting(nrf_link.rx_queue));
        get_next_pkg:
            nrf24l01_flush_rx(dev);
        } else {
            // Process IDLE events (switch no RX or TX state)
            if (nrf_link.state <= IDLE) {
                nrf_process_idle(dev, nrf_status, size);
            } else if (nrf_link.state == RX) {
                // Process RX events
                nrf_process_rx(dev, nrf_status, size);
            } else {
                // Cannot receive buffer
                log_info("rx in state %d", nrf_link.state);
                // TODO: cancel TX and start RX ???
                nrf24l01_flush_rx(dev);
            }
        }
        // Read size for next rx buffer
        nrf24l01_r_rx_pl_wid(dev, &size);
        // Update local status register
        nrf_status = nrf24l01_get_status(dev);
    } // End RX while
}

static void nrf_ip2mac(uip_ipaddr_t ip_addr, uint8_t* mac_addr)
{
    mac_addr[0] = (ip_addr[1] >> 8) & 0xff;
    mac_addr[1] = 0xc2;
    mac_addr[2] = 0xc2;
    mac_addr[3] = 0x12;
    mac_addr[4] = 0xc2;
}

static inline void nrf_process_idle(struct device *dev, uint8_t nrf_status, uint8_t size)
{
    // Read data into test buffer (first byte in ctl_byte, data in buffer)
    nrf24l01_read_rx_payload(dev, &nrf_link.rx_buffer->buf.ctl_byte, size);

    switch (nrf_status & nrf24l01_STATUS_RX_P_NO) {
    // check if a RTS frame as been received (rx pipe 2)
    case nrf24l01_STATUS_RX_P_NO_2:
        // Check dest addr
        // if (!memcmp(&nrf_link.rx_buffer->buf.data[5], nrf24l01_get_rx_addr(dev), 5)) {
        //     log_info("RTS me %02x %d", nrf_status, size);
        // }else {
        //     log_info("RTS other %02x %d", nrf_status, size);
        // }
        // Do not try to transmit, another node wants to because of RTS frame
        // Start NO_TX timeout timer
        xTimerStart(nrf_link.timer, (TickType_t)portMAX_DELAY);
        nrf_link.state = IDLE_NO_TX;
        break;

    // check if data frame is in the good pipe
    case nrf24l01_STATUS_RX_P_NO_1:
        // Valid data, start transfer if first byte is ok (0x80)
        if (nrf_link.rx_buffer->buf.ctl_byte & 0x80) {
            // Start a new transfert
            nrf_link.rx_pkg_count = nrf_link.rx_buffer->buf.ctl_byte & 0x3F;
            nrf_link.rx_pkg_index = 1;

            if (nrf_link.rx_pkg_count == 1) {
                log_info("pkg len 1");
                nrf_link.rx_buffer->len = size - 1;
                if (nrf_link.state == IDLE_NO_TX) {
                    // Stop IDLE_NO_TX timer
                    xTimerStop(nrf_link.timer, (TickType_t)portMAX_DELAY);
                }
                nrf_link.state = IDLE;
                // Send buffer
                xQueueSend(nrf_link.rx_queue, &nrf_link.rx_buffer, 0);
                // get new rx buffer
                nrf_link.rx_buffer = nrf_link_get_buffer();
                nrf_link.rx_packets++;
           }else {
                // Start timeout timer
                xTimerStart(nrf_link.timer, (TickType_t)portMAX_DELAY);
                nrf_link.state = RX;
                // RX state, exit idle process function
                return;
           }
        } else {
            // Ignore new transfert
            log_info("ipk %02x %02x (%d)", nrf_status, nrf_link.rx_buffer->buf.ctl_byte, size);
            nrf_link.state = IDLE;
            nrf24l01_flush_rx(dev);
        }
        break;
    default:
        log_error("RX in wrong pipe %02x", nrf_status);
    } // End switch pipe
}

static inline void nrf_process_rx(struct device *dev, uint8_t nrf_status, uint8_t size)
{
    // Read packet into rx buffer and save ctl_byte
    uint8_t last_data_byte = nrf_link.rx_buffer->buf.data[31*nrf_link.rx_pkg_index-1];
    nrf24l01_read_rx_payload(dev, &nrf_link.rx_buffer->buf.data[31*nrf_link.rx_pkg_index-1], size);
    uint8_t ctl_byte = nrf_link.rx_buffer->buf.data[31*nrf_link.rx_pkg_index-1];
    nrf_link.rx_buffer->buf.data[31*nrf_link.rx_pkg_index-1] = last_data_byte;

    if ((nrf_status & nrf24l01_STATUS_RX_P_NO) != nrf24l01_STATUS_RX_P_NO_1) {
        log_error("pipe %02x %d", nrf_status, nrf_link.rx_pkg_index);
        return;
    }
    if (nrf_link.rx_pkg_index == (ctl_byte & 0x3F)) {
        // Continue transfert
        nrf_link.rx_pkg_index++;

        if (nrf_link.rx_pkg_index == nrf_link.rx_pkg_count) {
            // Stop timeout timer
            xTimerStop(nrf_link.timer, (TickType_t)portMAX_DELAY);
            nrf_link.state = IDLE;
            nrf_link.rx_buffer->len = 31 * (nrf_link.rx_pkg_index - 1) + size - 1;
            // Send buffer
            xQueueSend(nrf_link.rx_queue, &nrf_link.rx_buffer, 0);
            // get new rx buffer
            nrf_link.rx_buffer = nrf_link_get_buffer();
            nrf_link.rx_packets++;
            return;
        // } else {
        //     // Reset timer ??? For now, if RX is not done during time slot, cancel it
        }
    } // End good pkg
    else {
        // Bad packet received, ignore and cancel RX
        // It is safer to drop package as there is no error detection system
        // This avoid timeout and start next transfert
        //
        // OK for now try to complete RX anyway until timeout
        // xTimerStop(nrf_link.timer, (TickType_t)portMAX_DELAY);
        // nrf_link.state = IDLE;
        // nrf24l01_flush_rx(dev);
        log_error("W %d %02x %d", size, ctl_byte, nrf_link.rx_pkg_index);
    }
}

