darcyg/nrf24l01_wsn/pic24f_RTOS_adv.X/framework/uip/nrf24l01_link.c
static inline void nrf_process_tx_rts(struct device *dev, uint8_t nrf_status)
{
    if (nrf_status & nrf24l01_STATUS_MAX_RT) {
        // MAX_RT detected
        nrf24l01_clear_ce(dev);
        nrf24l01_flush_rx(dev);
        nrf24l01_set_as_rx(dev);
        nrf24l01_set_ce(dev);
        nrf_link.state = IDLE_NO_TX;
        // Restart timer for idle no tx delay
        xTimerStart(nrf_link.timer, (TickType_t)portMAX_DELAY);

        nrf24l01_flush_tx(dev);

        log_error("MAX_RT: rts %02x %02x", nrf_status, nrf24l01_get_config(dev));
    }
    else if (nrf_status & nrf24l01_STATUS_TX_DS) {
        // TX_DS detected
        nrf24l01_clear_ce(dev); // TODO: not needed ?

        uint8_t addr[5];
        memcpy(addr, nrf24l01_get_rx_addr(dev), 5);
        addr[0] = 0xc2; // TODO: get gateway addr
        nrf24l01_set_tx_addr(dev, addr, 1);

        nrf_link.tx_pkg_index = 0;
        nrf_link.retransmit_pkg = NRF_RETRANSMIT_PKG;

        nrf24l01_write_tx_payload(dev, &nrf_link.tx_buffer->buf.ctl_byte,
                                  ((nrf_link.tx_buffer->len + 1) >= 32 ? 32 : (nrf_link.tx_buffer->len + 1)));

        nrf24l01_transmit(dev);
        nrf_link.state = TX;
        xTimerStart(nrf_link.timer, (TickType_t)portMAX_DELAY);

        // log_info("rts done, tx");

        // // Fow now TX done
        // log_info("rts done");
        // nrf24l01_set_as_rx(dev);
        // nrf24l01_set_ce(dev);
        // nrf_link.state = IDLE_NO_TX;
        // // Restart timer for idle no tx delay
        // xTimerStart(nrf_link.timer, (TickType_t)portMAX_DELAY);
        // // Release TX buffer
        // nrf_link_free_buffer(nrf_link.tx_buffer);
        // nrf_link.tx_buffer = NULL;
    }
}

static inline void nrf_process_tx(struct device *dev, uint8_t nrf_status)
{
    if (nrf_status & nrf24l01_STATUS_MAX_RT) {
        nrf24l01_clear_ce(dev);
        // MAX_RT detected, check pkg retransmission count
        if (--nrf_link.retransmit_pkg) {
            // Reuse last tx payload
            nrf24l01_reuse_tx_pl(dev);
            // Transmit pkg
            nrf24l01_transmit(dev);
            // log_info("rt %d (%d)", nrf_link.tx_pkg_index, nrf_link.retransmit_pkg);
        } else {
            // MAX RT reached, cancel TX
            nrf24l01_set_as_rx(dev);
            nrf24l01_set_ce(dev);
            nrf_link.state = IDLE_NO_TX;
            xTimerStart(nrf_link.timer, (TickType_t)portMAX_DELAY);
            nrf24l01_flush_tx(dev);
            // log_info("MAX_RT %d", nrf_link.tx_pkg_index);
        }
    }
    else if (nrf_status & nrf24l01_STATUS_TX_DS) {
        nrf_link.tx_pkg_index++;
        if (nrf_link.tx_pkg_index >= (nrf_link.tx_buffer->buf.ctl_byte & 0x7F)) {
            nrf24l01_set_as_rx(dev);
            nrf24l01_set_ce(dev);
            // log_info("skb sent, good job (%d)", nrf_link.tx_pkg_index);
            nrf_link.state = IDLE_NO_TX;
            xTimerStart(nrf_link.timer, (TickType_t)portMAX_DELAY);
            // Free tx buffer
            nrf_link_free_buffer(nrf_link.tx_buffer);
            nrf_link.tx_buffer = NULL;
            nrf_link.tx_packets++;
        } else {
            // log_info("tx next %d (%d)", nrf_link.tx_pkg_index,
            //         (nrf_link.tx_pkg_index+1)*31 > (nrf_link.tx_buffer->len) ? (nrf_link.tx_buffer->len)%31 : 31);
            uint8_t old_data = nrf_link.tx_buffer->buf.data[31 * (nrf_link.tx_pkg_index)-1];
            nrf_link.tx_buffer->buf.data[31 * (nrf_link.tx_pkg_index)-1] = nrf_link.tx_pkg_index & 0x7F;

            nrf_link.retransmit_pkg = NRF_RETRANSMIT_PKG;

            nrf24l01_write_tx_payload(dev, &nrf_link.tx_buffer->buf.data[31 * nrf_link.tx_pkg_index-1],
                    (nrf_link.tx_pkg_index+1)*31 > (nrf_link.tx_buffer->len) ? (nrf_link.tx_buffer->len)%31+1 : 32);
            nrf24l01_transmit(dev);

            // Restore buffer data
            nrf_link.tx_buffer->buf.data[31 * (nrf_link.tx_pkg_index)-1] = old_data;

            // TODO: do not reset timer, only one timeout for one tx slot
        }
    }
}

void net_poll(TickType_t timeout)
{
    static struct nrf_buffer *tx_buffer = NULL;
    struct nrf_buffer *rx_buffer;

    // Check if a buffer is available
    if (nrf_link_wait_rx(&rx_buffer, timeout)) {
        // Process received buffer
        uip_len = rx_buffer->len;
        uip_buf = rx_buffer->buf.data;

        if (uip_len > 0) {
            uip_input();
            if (uip_len > 0) {
                rx_buffer->len = uip_len;
                // log_info("buffer to send %d", uip_len);
                nrf_link_send_buffer(rx_buffer);
            } else {
                nrf_link_free_buffer(rx_buffer);
            }
        }
    } else {
        // Process tcp/ip stack timeout
        // Try to get a valid TX buffer
        if (tx_buffer || (tx_buffer = nrf_link_get_buffer())) {
            unsigned int i;
            uip_buf = tx_buffer->buf.data;
            for(i = 0; i < UIP_CONNS; ++i) {
                uip_periodic(i);
                if(uip_len > 0) {
                    // log_info("uns %d", uip_len);
                    tx_buffer->len = uip_len;
                    nrf_link_send_buffer(tx_buffer);
                    tx_buffer = NULL;
                    break; // One connection at the time (not enough tx buffers)
                }
            }
        }
    }
}

unsigned int nrf_link_get_rx_packets(void)
{
    return nrf_link.rx_packets;
}
unsigned int nrf_link_get_rx_dropped(void)
{
    return nrf_link.rx_dropped;
}
unsigned int nrf_link_get_tx_packets(void)
{
    return nrf_link.tx_packets;
}
unsigned int nrf_link_get_tx_dropped(void)
{
    return nrf_link.tx_dropped;
}
